Tekla Open API Reference for Tekla Structures 2025
PluginPickerInput.Add Method
 Appends a picker input to the plug-in input.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public void Add(
	PickerInput input
)
Public Sub Add (
	input As PickerInput
)
Parameters
input
Type: Tekla.Structures.Drawing.PickerInput
The picker input to append.
See Also
Reference
PluginPickerInput Class
Tekla.Structures.Drawing Namespace